[
  {
    "id": "1",
    "title": "Graffiti – The Voice of the Streets",
    "slug": "graffiti-the-voice-of-the-streets",
    "content": "Graffiti has always been more than just paint on walls—it's a bold conversation between the artist and the city. Every spray, stroke, and shape carries a story. Some stories are personal. Some are political. And some simply add colour and life to spaces that were once empty or ignored.\n\nAt its core, graffiti is street art born from self-expression. It began as a way for people—often young artists—to claim their identity in busy, crowded cities. Tags, throw-ups, murals, characters, and colourful letters became their signatures. Over time, what started as a form of rebellion grew into a powerful art movement that influences music, fashion, advertising, and global pop culture.\n\nToday, graffiti has two sides. On one side is illegal graffiti, where artists mark walls without permission. On the other side is legal street art, where artists are invited to create murals that transform entire neighbourhoods. Both styles share the same spirit—creativity without limits.\n\nWhat makes graffiti special is its honesty. It's raw, direct, unfiltered, and unapologetic. It brings life to dull spaces, calls out social issues, sparks curiosity, and sometimes even starts conversations that society avoids.\n\nGraffiti is not just art—it's a voice.\n\nA voice of youth.\n\nA voice of streets.\n\nA voice of change.\n\nAnd as the world embraces street culture, graffiti continues to rise—one wall at a time.",
    "date": "2025-11-15",
    "excerpt": "Graffiti has always been more than just paint on walls—it's a bold conversation between the artist and the city. Every spray, stroke, and shape carries a story."
  },
  {
    "id": "2",
    "title": "The Story Behind Graffiti",
    "slug": "the-story-behind-graffiti",
    "content": "Graffiti has a fascinating history rooted in self-expression. It began when young artists in crowded cities wanted to make themselves seen. With limited access to traditional art spaces, they found their canvas in public walls, trains, and rooftops. This raw, fearless form of art slowly grew into a cultural movement.\n\nAs graffiti expanded, so did its styles—tags marked identity, throw-ups added flair, stencils delivered sharp messages, and large murals told entire stories. These styles became visual signatures of neighbourhoods and communities.\n\nBeyond its striking visuals, graffiti has always carried meaning. It reflects social issues, personal struggles, cultural pride, and the desire to be heard. Some view it as vandalism, while others admire it as powerful street art. But no matter the opinion, graffiti forces people to look, feel, and think. It reminds us that creativity doesn't always follow rules—sometimes, it rewrites them.",
    "date": "2025-11-14",
    "excerpt": "Graffiti has a fascinating history rooted in self-expression. It began when young artists in crowded cities wanted to make themselves seen."
  },
  {
    "id": "3",
    "title": "Graffiti: More Than Just Street Art",
    "slug": "graffiti-more-than-just-street-art",
    "content": "Graffiti is often dismissed as just scribbles on walls, but in reality, it is a deeply meaningful art form that blends skill, imagination, and emotion. Many artists spend years perfecting their technique—experimenting with colours, lines, shadows, typography, and characters. Every piece has intention behind it.\n\nGraffiti goes beyond decoration; it transforms a city's mood. A dull alleyway can become a bright, inspiring space through a single mural. A simple stencil can spark conversation. Graffiti pushes people to pause and reflect—something that rarely happens in today's fast-moving world.\n\nModern graffiti has become a cornerstone of global art culture. Artists are invited to paint large-scale murals, collaborate with fashion brands, and display their work in galleries. Some still choose the underground route, using graffiti to challenge norms and question society. Whether legal or underground, graffiti adds emotion and meaning to public spaces, proving that art truly belongs to everyone.",
    "date": "2025-11-13",
    "excerpt": "Graffiti is often dismissed as just scribbles on walls, but in reality, it is a deeply meaningful art form that blends skill, imagination, and emotion."
  },
  {
    "id": "4",
    "title": "Why Graffiti Matters in Urban Culture",
    "slug": "why-graffiti-matters-in-urban-culture",
    "content": "Graffiti plays an essential role in shaping the culture of any city. It adds personality to neighbourhoods, reflects the people living there, and tells stories that might otherwise remain hidden. When you walk through a city filled with graffiti, you immediately feel its pulse—its struggles, joys, energy, and uniqueness.\n\nThis art form is often rooted in resistance. When traditional platforms fail to represent certain voices, graffiti becomes a tool for expression. Artists use public walls to speak about identity, inequality, freedom, and change. It's a visual language that doesn't require permission or validation.\n\nToday, more cities are embracing graffiti as a constructive force. Legal walls and street art festivals give artists safe spaces to create. Communities come together to paint murals that beautify public areas. Graffiti also boosts tourism and gives neighbourhoods a fresh identity.\n\nIn short, graffiti matters because it represents the soul of a city—alive, expressive, and ever-evolving.",
    "date": "2025-11-12",
    "excerpt": "Graffiti plays an essential role in shaping the culture of any city. It adds personality to neighbourhoods, reflects the people living there, and tells stories that might otherwise remain hidden."
  },
  {
    "id": "5",
    "title": "The Evolution of Graffiti",
    "slug": "the-evolution-of-graffiti",
    "content": "The journey of graffiti is a story of transformation. What began as a form of rebellion—artists leaving their marks on trains and walls—soon grew into a powerful global movement. Early graffiti was simple: names, nicknames, and symbols. But as artists experimented over the years, graffiti became more complex, colourful, and expressive.\n\nToday, graffiti blends technique with culture. Many artists work professionally, creating murals for communities, cafes, brands, and events. These murals often highlight local culture, social issues, or simply beautify the area. At the same time, the underground side of graffiti continues to push creative boundaries and challenge authority.\n\nIts evolution shows how flexible and influential graffiti can be. It adapts to new styles, new tools, and new environments while still holding on to its original spirit of bold expression. Graffiti has grown from hidden corners of cities to global stages—and its journey is far from over. As long as walls exist, graffiti will continue to evolve, inspire, and redefine what art can be.",
    "date": "2025-11-11",
    "excerpt": "The journey of graffiti is a story of transformation. What began as a form of rebellion—artists leaving their marks on trains and walls—soon grew into a powerful global movement."
  },
  {
    "id": "6",
    "title": "Banksy: The Mysterious British Man of Graffiti",
    "slug": "banksy-the-mysterious-british-man-of-graffiti",
    "content": "Banksy is one of the most famous yet mysterious graffiti artists in the world. Known for his bold street art and powerful messages, Banksy's work appears suddenly on walls and buildings, surprising people everywhere. Even though he is widely recognized, no one knows his real identity, which adds to the excitement and curiosity around his art.\n\nBanksy's style is unique—he often uses stencils to create sharp, striking images that speak about politics, society, and human behaviour. His artwork is simple to look at but carries deep meaning, making people stop and think. From a girl letting go of a balloon to a protester throwing flowers, Banksy uses everyday images to share strong messages about peace, freedom, and hope.\n\nWhat makes Banksy even more interesting is the way he challenges the boundaries between art and vandalism. His pieces appear without permission, yet they are valued by people all over the world. Some of his artworks have even been protected by communities who want to preserve them. Banksy's mystery, creativity, and fearless commentary have made him a symbol of modern street art, proving that sometimes the most powerful artist is the one you never see.",
    "date": "2025-11-10",
    "excerpt": "Banksy is one of the most famous yet mysterious graffiti artists in the world. Known for his bold street art and powerful messages, Banksy's work appears suddenly on walls and buildings."
  },
  {
    "id": "7",
    "title": "Graffiti: Art or Vandalism?",
    "slug": "graffiti-art-or-vandalism",
    "content": "Graffiti is one of the most debated forms of expression in cities today. Some people see it as a colourful way to share messages, emotions, or creativity. Many artists use walls as their canvas to tell stories, brighten dull spaces, or express feelings that might not fit inside traditional art galleries.\n\nHowever, not everyone views graffiti positively. When it is done without permission, it becomes illegal and is considered vandalism. Many shop owners and residents feel that unwanted graffiti damages their property and makes the surroundings look messy. Cleaning it up also costs money and time, which adds to the frustration.\n\nSo, is graffiti art or vandalism? The answer depends on the situation. Graffiti created with permission, skill, and purpose can be a powerful form of art that adds character to a place. But graffiti done without consent can be harmful and disrespectful. In the end, graffiti can be both—it all depends on how and where it is created.",
    "date": "2025-11-09",
    "excerpt": "Graffiti is one of the most debated forms of expression in cities today. Some people see it as a colourful way to share messages, emotions, or creativity."
  }
]
